Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: In a subclass implementation, evaluate partial String according to the context, edit the text if necessary, and return by reference any edited string in new String.
ja: サブクラス実装では、文脈によってpartial Stringを評価して、必要ならばテキストを編集して、そして参照によって何らかの編集済み文字列をnew Stringにおいて返してください。

source: In a subclass implementation, evaluate partial String according to the context.
ja: サブクラス実装では、文脈によってpartial Stringを評価してください。

source: In addition to the Apple-provided units, you can define custom units.
ja: Apple提供の単位に加えて、あなたはあつらえの単位を定義できます。

source: In addition to the notification name and sender, dispatch table entries for distributed notification centers specify when the notification center delivers notifications to its observers.
ja: 通知名と送り手に加えて、分散通知センターそれぞれに対するディスパッチテーブル登録項目は、通知センターが通知をそれのオブザーバ（監視者）に送付する場合を細かく指定します。

source: In addition to the provided initializers, such as init With Objects:, you can create an NSArray object using an array literal.
ja: 提供されたイニシャライザ、init With Objects:などに加えて、あなたはNSArrayオブジェクトを配列リテラルを使って作成できます。

source: In addition to the provided instance methods, such as object(at:), you can access NSArray values by their indexes using subscripting.
ja: 提供されたインスタンスメソッド、object(at:),などに加えて、あなたはNSArray値にアクセスすることがそれらのインデックスによって添え字を使うことで可能です。

source: In addition to writing to its own ubiquity container, an app can write to any container directory for which it has the appropriate permission.
ja: それ独自の偏在コンテナに書き出すことにに加えて、アプリはそれが適切な権限を持つどんなコンテナディレクトリに対しても書き出せます。

source: In addition, if you execute an AppleScript script using the NSApple Script class, you get an instance of NSApple Event Descriptor as the return value, from which you can extract any required information.
ja: 加えて、あなたがAppleScriptスクリプトをNSApple Scriptクラスを使用して実行するならば、あなたはNSApple Event Descriptorのインスタンスを戻り値として得ます。

source: In addition:
ja: 加えて：

source: In an implementation of dealloc, do not invoke the superclass’s implementation.
ja: deallocの実装において、スーパークラスの実装を発動しないでください。

source: In bytes, the multiple of the page size that is closest to, but not greater than, byte Count (that is, the number of bytes rounded down to a multiple of the page size).
ja: バイトで、ベージサイズの倍数、それはbyte Countに最も近い、しかしそれより大きくありません（すなわち、ページサイズの倍数に切り下げられたバイト数）。

source: In bytes, the multiple of the page size that is closest to, but not less than, byte Count (that is, the number of bytes rounded up to a multiple of the page size).
ja: バイトで、ベージサイズの倍数、それはbyte Countに最も近い、しかしそれより小さくありません（すなわち、ページサイズの倍数に切り上げられたバイト数）。

source: In communication via stream-type sockets, the receiver is often the object returned in the user Info dictionary of NSFile Handle Connection Accepted.
ja: ストリーム型ソケット経由の通信において、レシーバはしばしばNSFile Handle Connection Acceptedのuser Info辞書において返されるオブジェクトです。

source: In cover methods for which suspension behavior is not an explicit argument, NSNotification Suspension Behavior Coalesce is the default.
ja: 待機挙動が明白な引数でない担当メソッドでは、NSNotification Suspension Behavior Coalesceが初期状態です。

source: In either case, the mutability of all deeper levels is unaffected.
ja: 両方の場合とも、すべてのより深い階層の可変性は影響を受けません。

source: In fact, when too many notifications are posted and the server’s queue fills up, notifications may be dropped.
ja: 実際、多すぎる通知が投函されるそしてサーバーのクエリがいっぱいになる場合、通知はボツにされるかもしれません。

source: In general, it is abbreviated as “kcal.” However, it may be abbreviated as “C” when used to represent food calories.
ja: 一般的に、それは “kcal” のように省略されます。しかしながら、それは食品カロリーを表すために使われる場合 “C” のように省略されるかもしれません。

source: In general, you should use the NSLog function instead of calling this function directly.
ja: 一般的に、あなたはNSLog関数を、この関数を直接に呼ぶ代わりに使うべきです。

source: In iOS 5.0 and later and in macOS 10.7 and later, File Manager includes methods for managing items stored in iCloud.
ja: iOS 5.0以降とmacOS 10.7以降では、File ManagerはiCloudに格納されるアイテムの管理のためのメソッドを含みます。

source: In iOS, the group identifier starts with the word group and a dot, followed by the group name.
ja: iOSでは、グループ識別子は単語groupと１つのドットで始まり、グループ名が続きます。

source: In iOS, the home directory is the application’s sandbox directory.
ja: iOSでは、ホームディレクトリはアプリケーションのサンドボックスディレクトリです。

source: In iOS, the value is nil when the group identifier is invalid.
ja: iOSでは、この値はグループ識別子が無効である場合はnilです。

source: In iOS, you must call this method at least once before trying to search for cloud-based files in the ubiquity container.
ja: iOSでは、あなたはこのメソッドを少なくとも一度は偏在コンテナにおいてクラウド基盤のファイルの検索を試みる前に呼び出さなければなりません。

source: In macOS 10.12 and later or iOS 10 and later, use the ISO8601Date Formatter class when working with ISO 8601 date representations.
ja: macOS 10.12以降またはiOS 10以降では、ISO 8601日付表現を扱う場合はISO8601Date Formatterクラスを使ってください。

source: In macOS 10.5 and later, you can unload a bundle’s executable code using this method.
ja: macOS 10.5以降では、あなたはバンドルの持つ実行可能コードをこのメソッドを使ってアンロードできます。

source: In macOS 10.6 and later, NSFile Wrapper memory-maps files that are on internal drives only.
ja: macOS 10.6以降では、NSFile Wrapperは、内部デバイス上にあるファイルのみをメモリマップします。

source: In macOS 10.7 and later, the delegate must conform to the File Manager Delegate protocol.
ja: macOS 10.7以降では、委任先はFile Manager Delegateプロトコルに準拠しなければなりません。

source: In macOS 10.7 or earlier, the framework takes a coordinated write in its implementation of this method, so taking one in your app causes a deadlock.
ja: macOS 10.7以前において、フレームワークは協調書き込みをこのメソッドのそれの実装において取ります、それであなたのアプリにおいてそれを取ることはデッドロックの原因となります。

source: In macOS 10.8 and later, the framework detects coordination done by your app on the same thread as the call to this method, to avoid deadlocking.
ja: macOS 10.8以降では、フレームワークは、あなたのアプリによって同じスレッド上でこのメソッドに対する呼び出しとして行われる協調を検知します、デッドロックを避けるために。

source: In macOS 10.9 and later NSDate Formatter is thread safe so long as you are using the modern behavior in a 64-bit app.
ja: macOS 10.9以降ではNSDate Formatterはスレッド安全です、あなたが64-bitアプリでのモダンな挙動を使っている限りは。

source: In macOS 10.9 and later and iOS 7 and later, NSHTTPCookie Storage is thread safe.
ja: macOS 10.9以降およびiOS 7以降では、NSHTTPCookie Storageはスレッド安全です。

source: In macOS, a URL of the expected form is always returned, even if the app group is invalid, so be sure to test that you can access the underlying directory before attempting to use it.
ja: macOSでは、期待される形式のURLが常に返されます、アプリのグループが無効であってさえもです、なのであなたがそれを使おうと試みる前に基底ディレクトリにアクセス可能であることのテストを確実にしてください。

source: In macOS, instances of NSText Checking Result are returned by the NSSpell Checker object to describe the results of spelling, grammar, or text-substitution actions.
ja: macOSにおいて、NSText Checking ResultのインスタンスはNSSpell Checkerオブジェクトによって返されて、綴り、文法、またはテキスト置換動作の結果を記述します。

source: In macOS, it is the application’s sandbox directory or the current user’s home directory (if the application is not in a sandbox)
ja: macOSでは、それはアプリケーションのサンドボックスディレクトリまたは現在のユーザのホームディレクトリです（アプリケーションがサンドボックスの中でないならば）。

source: In macOS, you can instead use an NSDocument object, which establishes access automatically.
ja: macOSでは、あなたは代わりにNSDocumentオブジェクトを使用できます、それはアクセスを自動的に確立します。

source: In macOS, you do not need to call this method if you use NSDocument-based objects, because the system then calls this method automatically.
ja: macOSでは、あなたはこのメソッドを呼び出す必要はありません、あなたがNSDocumentに基づくオブジェクトを使うならば、なぜならシステムはその時このメソッドを自動的に呼び出すからです。

source: In macOS 10.5 and later, use subpaths Of Directory(at Path:) instead.
ja: macOS 10.5以降では、subpaths Of Directory(at Path:)を代わりに使ってください。

source: In most cases where you need to retrieve bundle resources, it is preferable to use the NSBundle instance methods instead.
ja: あなたがバンドルリソースを取ってくる必要があるところのほとんどの場合において、NSBundleインスタンスメソッドを代わりに使う方が望ましいでしょう。

source: In other words, this is the destination of the link.
ja: 言い換えれば、これはリンクの行き先です。

source: In other words, this method must not return normally; it must always result in an exception being thrown.
ja: 言い換えれば、このメソッドは普通に返してはいけません；それは常に例外をスローされる結果になる必要があります。

source: In other words, you must bind() the socket, and ensure that the socket has a connection backlog defined by listen().
ja: 言い換えれば、あなたはソケットをbind()しなければなりません、そしてソケットがlisten()によって定義される接続バックログを持つことを保証しなければなりません。

source: In particular, the names "Bethany" and "Eric" are removed from employees.
ja: 個別的には、"Bethany"と"Eric"がemployeesから除去されます。

source: In some cases, (for example, a Data backed by a dispatch_data_t, the bytes may be stored discontiguously.
ja: いくつかの場合には、（例えば、Dataがdispatch_data_tによって裏打ちされる、バイトは不連続に格納されるかもしれません。

source: In some cases, you may not need Codable's support for bidirectional encoding and decoding.
ja: いくつかの場合には、あなたはCodableのもつ双方向のエンコーディングとデコーディングに対する支援を必要としないかもしれません。

source: In such a case, you are responsible for closing the file descriptor at some point after disposing of the file handle object.
ja: そのような場合には、あなたはファイルハンドルオブジェクトを処分した後のある時点でファイル記述子を閉じることに責任があります。

source: In that case, the method returns nil.
ja: その場合には、このメソッドはnilを返します。

source: In that dictionary, add the UINib External Objects key and set its value to a dictionary containing the names of any proxy objects (the keys) and the real objects to use in their place.
ja: その辞書において、UINib External Objectsキーを追加して、それの値を、あらゆるプロキシオブジェクトの名前（キー）とそれらの場所で使う実際のオブジェクトを含んでいるある辞書に設定しください。

source: In the default macOS desktop coordinate system—where the origin is at the bottom left—the rectangle edge closest to the bottom of the screen is the “upper” edge (and is considered inside the rectangle).
ja: 初期状態のmacOSデスクトップ座標システムにおいて — そこにおいて原点は下左です — 画面の下に最も近い矩形の端は、「上」端です（そして矩形内と考えられます）。

source: In the event that the start dates are equal, the compare method will attempt to order by duration.
ja: 開始日付同士が等しい場合には、比較メソッドは間隔によって順番付けを試みます。

source: In the event that there is no intersection, the method returns nil.
ja: 交わりがないという場合には、メソッドはnilを返します。

source: In the example below, the Coordinate structure is extended to conform to the Decodable protocol by implementing its required initializer, init(from:):
ja: 下の例において、Coordinate構造体は拡張されて、Decodableプロトコルにそれの必須イニシャライザ、init(from:)を実装することで準拠します：

source: In the examples below, the Coordinate structure is expanded to support an elevation property that's nested inside of an additional Info container:
ja: 下の例において、Coordinate構造体は拡張されることでelevationプロパティをサポートします、それはadditional Infoコンテナの内部に入れ子にされます：

source: In the following example case, the iteration is stopped after a certain number of matches have been found.
ja: 以下の例の場合には、繰り返しは、特定の数のマッチが見つけられた後で中止されます。

source: In the following example, Reporter would be the principal class:
ja: 以下の例において、Reporterはプリンシパルクラスになるでしょう：

source: In the following example, an array of numbers is partitioned by a predicate that matches elements greater than 30.
ja: 次の例において、数からなる配列は、30より大きな要素に合致するという述部によって仕切られます。

source: In the following example, the .priority shipping option is removed from the options option set.
ja: 以下の例において、.priority出荷オプションは、optionsオプションセットから除去されます。

source: In the following example, the .second Day shipping option is added to the free Options option set if purchase Price is greater than 50.0.
ja: 次の例において、.second Day出荷オプションは、purchase Priceが50.0より大きいならば、free Optionsオプションセットを加えられます。

source: In the following example, the employees set is disjoint with the visitors set because no name appears in both sets.
ja: 次の例において、employees集合はvisitors集合と交わりを持ちません、両方に現れる名前がないからです。

source: In the following example, the non Neighbors set is made up of the elements of the employees set that are not elements of neighbors:
ja: 次の例において、non Neighbors集合はemployees集合の要素でneighborsの要素でないものから作り上げられます：

source: In the following example, the closure provides an ordering for an array of a custom enumeration that describes an HTTP response.
ja: 以下の例では、そのクロージャは、あるHTTP応答を記述するあつらえ列挙の配列に対してある順序付けを提供します。

source: In the following example, the elements of the employees set that are also members of the neighbors set are removed.
ja: 次の例において、employees集合の要素でまたneighbors集合のメンバでもあるものは除去されます。

source: In the following example, the predicate provides an ordering for an array of a custom HTTPResponse type.
ja: 以下の例では、その述部はあつらえのHTTPResponse型の配列に対してある順序付けを提供します。

source: In the next example you use the Any Key structure defined above to customize the decoding of the A, B, and C structures.
ja: 次の例においてあなたは上で定義されるAny Key構造体を使って、A、B、そしてC構造体のデコーディングをカスタマイズします。

source: In the next example, the .express element is passed to remove(_:).
ja: 次の例では、.express要素がremove(_:)に渡されます。

source: In the next example, you use the Any Key structure defined above to customize the encoding of the A, B, and C structures.
ja: 次の例においてあなたは上で定義されるAny Key構造体を使って、A、B、そしてC構造体のエンコーディングをカスタマイズします。

source: In the receiving task, it is deserialized back into a dictionary.
ja: 受け取っているタスクにおいて、それは元の辞書へとデシリアライズされます。

source: In the simple case, in which an object forwards messages to just one destination (such as the hypothetical friend instance variable in the example below), a forward Invocation: method could be as simple as this:
ja: オブジェクトがメッセージをただ１つの目的地に転送する（以下の例での仮定のfriendインスタンス変数ように）、単純な場合では、forward Invocation:メソッドはこれと同じくらい単純でありえます：

source: In this case, the copy will use its own deallocator.
ja: この場合には、コピーはそれ自身のデアロケータを使うでしょう。

source: In this case, the template reverses the two letters of the word.
ja: この場合では、テンプレートは語の２つの文字を逆にします。

source: In this example, filter(_:) is used to include only names shorter than five characters.
ja: この例において、filter(_:)は５つの文字より短い名前のみ含めるために使われます。

source: In this example, map is used first to convert the names in the array to lowercase strings and then to count their characters.
ja: この例では、mapは最初に配列中の名前を小文字文字列に変換するために、それからそれらの文字を数えるために使われます。

source: In this example, an array of three ranges is flattened so that the elements of each range can be iterated in turn.
ja: この例において、３つの範囲からなる配列は平坦化されます、それで各範囲の要素は順に反復されることができます。

source: In this example, note the difference in the result of using map and compact Map with a transformation that returns an optional Int value.
ja: この例において、mapとcompact Mapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, three elements in the middle of an array of integers are replaced by the five elements of a Repeated<Int> instance.
ja: この例では、整数からなる配列の真ん中の３つの要素が、Repeated<Int>インスタンスの５つの要素によって置き換えられます。

source: In those cases, this function invokes the closure for each contiguous region of bytes.
ja: それらの場合には、この関数は各隣接バイト領域に対してクロージャを発動します。

source: In those cases, what is found may be a match for a regular expression or a date, address, phone number, and so on.
ja: それらの場合において、見つけられたものは正規表現またはあるデータ、住所、電話番号、などなどに対して一致するものでしょう。

source: In working with Apple event descriptors, it can be useful to understand some of the underlying data types.
ja: アップルイベント記述子を扱う場合に、いくつかの基盤データ型を理解するのは役立つことがあります。

source: In your implementation, return an NSString object that is used for editing, following the logic recommended for implementing string(for:).
ja: あなたの実装では、編集に使われるNSStringオブジェクトを、string(for:)の実装に勧められる論理に従って、返してください。

source: Includes all of the above and future items.
ja: 以前のそしてこの先の項目の全てを含みます。

source: Including a filename extension is optional
ja: ファイル名拡張子を含めることは任意です

source: Including a filename extension is optional.
ja: ファイル名拡張子を含めることは任意です。

source: Increments the specified object’s reference count.
ja: 指定されたオブジェクトの持つ参照カウントを漸増します。

source: Indeed, the directory is accessible only with the file URL returned by this method.
ja: 本当に、ディレクトリはこのメソッドによって返されるファイルURLでのみアクセス可能です。

source: Indexed access
ja: インデックスでのアクセス

source: Indexes
ja: インデックス

source: Indicates that one index is greater than another.
ja: 一方のインデックスが他のものより大きいことを指し示します。

source: Indicates that one index is less than another.
ja: 一方のインデックスが他のものより少ないことを指し示します。

source: Indicates that two indexes are equal.
ja: ２つのインデックスが等しいことを指し示します。

source: Indicates whether a given table contains a given key.
ja: 与えられたテーブルが、与えられたキーを含むかどうかを指し示します。

source: Indicates whether an object should be retained.
ja: あるオブジェクトがリテイン（保持）されるべきかどうかを指し示します。

source: Indicates whether one date interval is strictly less than another.
ja: 一方の日付間隔が他方より厳密に少ないかどうかを指し示します。

source: Indicates whether the contents of a file wrapper matches a directory, regular file, or symbolic link on disk.
ja: ファイルラッパーの内容がディスク上のディレクトリ、通常ファイル、またはシンボリックリンクと合致するかどうかを指し示します。

source: Indicates whether the current combination of properties represents a date which exists in the current calendar.
ja: 現在のプロパティの組み合わせが、現在のカレンダーに存在する日付を表すかどうかを指し示します。

source: Indicates whether the current combination of properties represents a date which exists in the specified calendar.
ja: 現在のプロパティの組み合わせが、指定されたカレンダーに存在する日付を表すかどうかを指し示します。

source: Indicates whether the file wrapper needs to be updated to match a given file-system node.
ja: 与えられたファイルシステムノードに合致するためにファイルラッパーが更新されることを必要とするかどうかを指し示します。

source: Indicates whether the receiver represents the same host as another NSHost object.
ja: レシーバが別のNSHostオブジェクトと同じものを表すかどうかを指し示します。

source: Indicates whether this decimal is equal to the specified one.
ja: この10進数が指定されたものと等しいかどうかを指し示します。

source: Indicates whether this decimal is less than or equal to the specified one.
ja: この10進数が指定されたものより小さいかまたは等しいかどうかを指し示します。

source: Indicates whether this decimal is less than the specified one.
ja: この10進数が指定されたものより小さいかどうかを指し示します。

source: Indicates whether this interval contains the given date.
ja: この間隔が与えられた日付を含むかどうかを指し示します。

source: Indicates whether this interval intersects the specified interval.
ja: この間隔が指定された間隔と交わるかどうかを指し示します。

source: Indicates whether two date component instances are the same.
ja: ２つの日付構成要素が同じかどうかを指し示します。

source: Indicates whether two date intervals are the same.
ja: ２つの日付間隔が同じかどうかを指し示します。

source: Indicates whether two range views are the same.
ja: ２つの範囲ビューが同じかどうかを指し示します。

source: Indicates whether two transforms are the same.
ja: ２つの変換が同じかどうかを指し示します。

source: Inequality is the inverse of equality.
ja: 不等性は、同等性の裏返しです。

source: Information about an error condition including a domain, a domain-specific error code, and application-specific information.
ja: ある領域、ある領域特有のエラーコード、そしてアプリケーション特有の情報を含んでいるエラー条件についての情報。

source: Information about linguistic, cultural, and technological conventions for use in formatting data for presentation.
ja: 提示用にデータの体裁を整えるのに使う言語学的な、文化的な、そして技術学上の慣行についての情報。

source: Information about standard time conventions associated with a specific geopolitical region.
ja: 指定された地政学的境界に関連付けられる標準時刻慣例についての情報。

source: Informs the observed object that the specified change has occurred on the indexes for a specified ordered to-many relationship.
ja: 指定された変更がいくつかの与えられたインデックスである指定された順序付けられた対多関係に対して起こったことを監視されるオブジェクトに知らせます。

source: Informs the observed object that the specified change is about to be executed at given indexes for a specified ordered to-many relationship.
ja: 指定された変更がいくつかの与えられたインデックスである指定された順序付けられた対多関係に対して実行されようとしていることを監視されるオブジェクトに知らせます。

source: Informs the observed object that the specified change is about to be made to a specified unordered to-many relationship.
ja: 指定された変更がある指定された順序付けられない対多関係に対してされようとしていることを監視されるオブジェクトに知らせます。

source: Informs the observed object that the specified change was made to a specified unordered to-many relationship.
ja: 指定された変更がある指定された順序付けられない対多関係に対してされたことを監視されるオブジェクトに知らせます。

source: Informs the observed object that the value of a given property has changed.
ja: 与えられたプロパティの値が変更されたことを監視されるオブジェクトに知らせます。

source: Informs the observed object that the value of a given property is about to change.
ja: 与えられたプロパティの値が変更されようとしていることを監視されるオブジェクトに知らせます。

source: Informs the observing object when the value at the specified key path relative to the observed object has changed.
ja: 監視されるオブジェクトに相対的な、指定されるキーパスでの値が変化した時に、監視されるオブジェクトに知らせます。

source: Inherited By
ja: 継承される先

source: Inherits From
ja: 継承元

source: Initialize an empty instance.
ja: 空のインスタンスを初期化します

source: Initialize with a bitmap representation.
ja: あるビットマップ表現を使って初期化します

source: Initialize with the characters in the given string.
ja: 与えられた文字列の中の文字で初期化します。

source: Initialize with the contents of a file.
ja: あるファイルの内容で初期化します。

source: Initialized file wrapper for file Wrappers.
ja: file Wrappersに対して初期化されたファイルラッパー。

source: Initialized regular-file file wrapper containing contents.
ja: 初期化された通常ファイルファイルラッパー、contentsを含んでいます。

source: Initialized symbolic-link file wrapper referencing node.
ja: 初期化されたシンボリックファイルラッパー、nodeを参照しています。

source: Initialized symbolic-link file wrapper referencing url.
ja: 初期化されたシンボリックリンクファイルラッパー、urlを参照しています。

source: Initializers
ja: イニシャライザ

source: Initializes a date components value, optionally specifying values for its fields.
ja: 日付構成要素値を初期化します、随意にそれの各情報単位欄に対して値を指定します。

source: Initializes a dimensional unit with the specified symbol and unit converter.
ja: 寸法の単位を専門のシンボルと単位コンバータで初期化する。

source: Initializes a file wrapper instance whose kind is determined by the type of file-system node located by the URL.
ja: ファイルラッパーインスタンスを初期化します、それのもつ種類はURLによって位置決めされるファイルシステムノードの型によって決定されます。

source: Initializes a file wrapper instance whose kind is determined by the type of file-system node located by the path.
ja: ファイルラッパーインスタンスを初期化します、それのもつ種類はパスによって位置決めされるファイルシステムノードの型によって決定されます。

source: Initializes a newly allocated array by placing in it the objects contained in a given array.
ja: 新たしく割り当てされた配列を、与えられた配列の中に含まれるオブジェクトをそれの中に置くことによって初期化します。

source: Initializes a newly allocated array by placing in it the objects in the argument list.
ja: 新しく割り当てられた配列を、引数リストのオブジェクトをそれの中に置くことによって初期化します。

source: Initializes a newly allocated array to include a given number of objects from a given C array.
ja: 新しく割り当てられた配列を初期化して、与えられた数のオブジェクトを与えられたC配列から含めるようにします。

source: Initializes a newly allocated array using an Array as the source of data objects for the array.
ja: 新しく割り当てられた配列を、an Arrayをその配列のデータオブジェクトのソースとして使って初期化します。

source: Initializes a newly allocated array with the contents of the file specified by a given path.
ja: 新しく割り当てられた配列を、与えられたパスによって指定されるファイルの内容で初期化します。

source: Initializes a newly allocated array with the contents of the location specified by a given URL.
ja: 新しく割り当てられた配列を、与えられたURLによって指定された位置での内容で初期化します。

source: Initializes a newly allocated array.
ja: 新しく割り当てられた配列を初期化します

source: Initializes a newly allocated instance as a descriptor for an Apple event, initialized with the specified values.
ja: 新たに割り当てされたインスタンスをあるアップルイベントに対する記述子として初期化します、指定された値で初期化されます。

source: Initializes a newly allocated instance as a descriptor for the specified Carbon AEDesc structure.
ja: 新たに割り当てされたインスタンスを指定されたCarbonAEDesc構造体に対する記述子として初期化します。

source: Initializes a newly allocated instance as a descriptor that is an Apple event record.
ja: 新たに割り当てされたインスタンスをアップルイベントレコードである記述子として初期化します。

source: Initializes a newly allocated instance as a descriptor with the specified descriptor type and data (from an arbitrary sequence of bytes and a length count).
ja: 新たに割り当てされたインスタンスを指定された記述子型とデータ（随意のバイトシーケンスと長さ合計から）を伴う記述子として初期化します。

source: Initializes a newly allocated instance as a descriptor with the specified descriptor type and data (from an instance of NSData).
ja: 新たに割り当てされたインスタンスを指定された記述子型とデータ（NSDataのインスタンスから）を伴う記述子として初期化します。

source: Initializes a newly allocated instance as an empty list descriptor.
ja: 新たに割り当てされたインスタンスを空のリスト記述子として初期化します。

source: Initializes a newly allocated script instance from the passed source.
ja: 渡されたソースからの、新しく割り当てされたスクリプトインスタンスを初期化します。

source: Initializes a newly allocated script instance from the source identified by the passed URL.
ja: 渡されたURLによって識別されるソースからの、新しく割り当てされたスクリプトインスタンスを初期化します。

source: Initializes an NSCached URLResponse object.
ja: NSCached URLResponseオブジェクトを初期化します。

source: Initializes an HTTP URL response object with a status code, protocol version, and response headers.
ja: HTTP URL応答オブジェクトをステータスコード、プロトコルバージョン、そしてレスポンスヘッダで初期化します。

source: Initializes an ISO 8601 date formatter with default format, time zone, and options.
ja: ISO 8601日付フォーマッタを省略時の書式設定、タイムゾーン、そしてオプションで初期化します。

source: Initializes an NSCachedURLResponse object.
ja: NSCachedURLResponseオブジェクトを初期化します。

source: Initializes an empty index set.
ja: 空のインデックス集合を初期化します。
